# ================================== Start

"""
01

"""


num_01 = int(input())
print(num_01 + 1)

# ================================== End

# ================================== Start
"""
整数 n が1行目、続く行で n 個の文字列が与えられるので、n 個の文字列をそのまま出力

入力例1
3
AB
CD
EF

出力例1
AB
CD
EF

入力例2
3
1
2
3

出力例2
1
2
3

"""

num_02 = int(input())
arr_03 = []

idx_02 = 0
while num_02 > idx_02:
    tmp = input()
    print(tmp)
    idx_02 += 1

# ================================== End

# ================================== Start

"""

入力例1
Hello World

出力例1
Hello
World

入力例2
apple orange

出力例2
apple
orange

"""

a_str_04, b_str_04 = map(str, input().split())

print(a_str_04)
print(b_str_04)

# ================================== End

# ================================== Start

"""

スペース区切りの2つの整数が入力されるので、それらを足して出力

力例1
0 0

出力例1
0

入力例2
1 2

出力例2
3

入力例3
10 20

出力例3
30

"""
i_num_05 = input().split()
print(int(i_num_05[0]) + int(i_num_05[1]))

# ================================== End

# ================================== Start

"""

"""

# ================================== End

# ================================== Start

"""

"""

# ================================== End
