
# ================================== Start

"""

出力例1
Hello
World

入力例2
0 1

出力例2
0
1

入力例3
a b

出力例3
a
b

"""
str_01 = input()

for str_01_val in str_01.split():
    print(str_01_val)

# ================================== End

# ================================== Start

""" 
スペース区切りの2つの整数が入力されるので、それらを足して出力

入力例1
0 0

出力例1
0

入力例2
1 2

出力例2
3

入力例3
10 20

出力例3
30

"""

a_02, b_02 = map(int, input().split())
print(a_02 + b_02)

# ================================== End
